A
A.
ABC
AIDS
Afghan
Africa
African
Afro-
Albanian
Algerian
Allah
America
American
Anglo-
Angolan
Antarctic
April
Arabia
Arabian
Arabic
Argentinian
Asia
Asian
Atlantic
August
Australian
Austrian
Austro-
B
BBC
Babylonian
Bangladeshi
Barbadian
Belgian
Bengali
Bible
Bolivian
Brazilian
British
Briton
Buddha
Buddhism
Buddhist
Bulgarian
Burmese
Byelorussian
Byzantine
C
CAD(abbre
CD
Canadian
Cantonese
Caribbean
Catholic
Catholicism
Celsius
Chancellor
Chinese
Christ
Christian
Christianity
Christmas
City
Co
Colombian
Congress
Corp
Cuban
Cypriot
Czar
Czech
Czechoslovak
D
Dacron
Danish
December
Derby
Dr
Dutch
E
East German
Easter
Egyptian
English
Englishman
Englishwoman
Eskimo
Esperanto
Ethiopian
Euro-
Europe
European
F
FALSE
Fahrenheit
February
Finnish
Franco-
French
Frenchman
Friday
G
German
Ghanaian
Gothic
Grand
Greek
Gulf
H
HIV
HRH(abbre
Halloween,
Hebrew
Highness
Hindi
Hindu
Hinduism
Hispanic
Hollywood
Hoover
Hungarian
I
Icelandic
Inc
Indian
Indonesian
Iranian
Iraqi
Irish
Islam
Islamic
Israel
Israeli
Italian
J
January
Japanese
Jesus
Jew
Jewish
Jordanian
July
June
Jupiter
K
Kenyan
Koran
Korean
Kuwaiti
L
Labour Party
Latin
Lebanese
Lesbian
Liberian
Libyan
Lithuanian
Ltd
M
MP
Mafia
Malaysian
Maltese
Maori
March
Mars
Marxism
Marxist
Mass,
May
Mecca
Mediterranean
Messiah
Mexican
Middle East
Miss2
Mister
Monday
Mongolian
Moroccan
Mr
Mr.
Mrs
Mrs.
Ms
Muslim
N
NATO
Nazi
Nazism
Negro
New Zealander
Nigerian
Nordic
Norwegian
November
O
October
Okay,
Olympic
Orient
P
PM
Pacific
Pakistani
Palestinian
Persian
Persian Gulf
Peruvian
PhD
Pole
Polish
Portuguese
Prime Minister
Protestant
Puritan
Q
Quaker
R
RAM
Roman
Romanian
Rome
Russian
S
SOS
Sabbath
Santa
Satan
Saturday
Saturn
Saudi
Scandinavian
Scotch
Scotland
Scots
Scotsman
Scotswoman
Scottish
Secretary of State
Security Council
Senate
Senegalese
September
Singaporean
Soviet
Spain
Spaniard
Spanish
State Department
Sudanese
Sunday
Swede
Swedish
Swiss
Switzerland
Syrian
T
TRUE
TV
Thai
Thanksgiving
Third World
Thursday
Tibetan
Tory
Tsar
Tuesday
Tunisian
Turkish
U
UFO
UK
UN
US
USA
Ugandan
United
United Nations
Utopia
V
VIP
Valentine
Venus
W
Wall Street
Wednesday
Welsh
West German
West Indian
White House
X
X-chromosome
X-ray
Xerox
Y
Yahoo
Yankee
Yemeni
Yugoslav
Yugoslavian
Z
Zionism
Zulu
a
a,
a-1
a-2
abacus
abandon
abandoned
abase
abash
abashed
abate
abbey
abbreviate
abbreviation
abdicate
abdomen
abdominal
abduct
aberrant
aberration
abet
abeyance
abhor
abhorrent
abide
abiding
ability
abject
abjure
ablaze
able
ablution
ably
abnegate
abnegation
abnormal
abnormality
aboard
abode
abolish
abolition
abominable
abominate
aboriginal
aborigine
abort
abortion
abortive
abound
about
above
aboveboard
abrade
abrasion
abrasive
abreast
abridge
abroad
abrogate
abrupt
abruptly
abscission
abscond
absence
absent
absent-minded
absentee
absenteeism
absolute
absolutely
absolve
absorb
absorbing
absorption
abstain
abstemious
abstention
abstentious
abstinence
abstinent
abstract
abstraction
abstruse
absurd
abundance
abundant
abuse
abusive
abut
abysmal
abyss
academic
academician
academician/əˌkædəˈmɪʃən/n.院士，学会会员
academy
acarpous
accede
accelerate
accent
accentuate
accept
acceptable
acceptable/əkˈseptəbl/adj.可接受的,值得接受的,合意的
acceptance
accepted
access
accessible
accession
accessory
accident
accidental
acclaim
acclimate
accolade
accommodate
accommodating
accommodation
accompaniment
accompanist
accompany
accomplice
accomplish
accomplished
accomplishment
accord
accordance
according
according to
accordingly
accordion
accost
account
account for
accountability
accountable
accountancy
accountant
accredit
accrete
accretion
accrue
accumulate
accuracy
accurate
accusation
accuse
accustom
accustomed
ace
acerbic
acerbity
ache
achieve
achievement
achromatic
acid
acknowledge
acknowledgement
acme
acolyte
acorn
acoustic
acoustics
acquaint
acquaintance
acquainted
acquiesce
acquire
acquired
acquisition
acquisitive
acquit
acquittal
acre
acrid
acrimonious
acrimony
acrobat
acronym
acrophobia
across
act
act out
act up
acting
action
activate
active
activist
activity
actor
actress
actual
actuality
actually
actuarial
actuate
acuity
acumen
acupuncture
acute
ad
adage
adamant
adapt
adaptable
adaptation
adapter,
add
add in
add on
add up
add up to
add-on
addendum
addict
addicted
addiction
addictive
addition
additional
additionally
additive
addle
address
adduce
adept
adequate
adhere
adherence
adherent
adhesive
adjacent
adjective
adjoin
adjoining
adjourn
adjudicate
adjunct
adjust
adjustment
adlib
administer
administration
administrative
administrator
admirable
admiral
admiration
admire
admissible
admission
admit
admittedly
admonish
ado
adobe
adolescence
adolescent
adopt
adoption
adore
adorn
adrift
adroit
adulate
adult
adulterate
adultery
adulthood
adumbrate
adv.1.近海2.离海岸
adv.冷静地，镇定地v.1.冷下来2.使变冷
adv.花部分时间，兼职地
advance
advanced
advantage
advantageous
advent
adventitious
adventure
adventurism
adventurist
adventurous
adverb
adverbial
adversary
adverse
adversity
advert
advertise
advertisement
advertising
advice
advisable
advise
adviser
adviser,
advisory
advocacy
advocate
aegis
aerate
aerial
aero-
aerobatics
aerobic
aerobics
aerodynamics
aeronautics
aeroplane
aerosol
aerospace
aesthete
aesthetic
aesthetics
affable
affair
affect
affect1
affect2
affectation
affected
affection
affectionate
affidavit
affiliate
affiliation
affinity
affirm
affirmative
affix
afflict
afflicting
affliction
affluence
affluent
afford
affordable
affront
afield
afloat
afoot
afraid
afresh
after
after-
aftereffect
aftermath
afternoon
afterward(s)
afterwards
again
against
agape
age
aged
agency
agenda
agent
agglomerate
aggrandize
aggravate
aggravate/ˈæɡrəveɪt/v.加重(病情、负担等)，使恶化
aggregate
aggression
aggressive
aggressor
aggrieve
aggrieved
aghast
agile
agility
agitate
agitated
agitation
agnostic
agnostic/æɡˈnɒstɪk/n.&adj.不可知论者(的)
ago
agog
agonize
agonizing
agony
agrarian
agree
agreeable
agreement
agricultural
agriculture
agro-
agronomy
aground
ah
ahead
aid
ail
ailing
ailment
aim
aimless
air
air force
air-conditioned
airbase
airborne
aircraft
airfield
airforce
airhostess
airily
airlift
airline
airliner
airmail
airport
airstrip
airtight
airway
airy
aisle
ajar
alabaster
alacrity
alarm
alas
albeit
albino
album
alchemist
alchemy
alcohol
alcoholic
alcoholism
alcove
ale
alert
alga
algebra
alias
alibi
alien
alienate
alight1
alight2
align
alike
alimentary
alimony
alive
alkali
all
all right
allay
allegation
allege
alleged
allegedly
allegiance
allegory
allergic
allergy
alleviate
alley
alliance
allied
alligator
alliterate
allocate
allocation
allot
allow
allow for
allowance
alloy
allude
allure
alluring
allusion
ally
almanac
almighty
almond
almost
alms
aloft
alone
along
alongside
aloof
aloud
alphabet
alphabetic(al)
alphabetical
already
also
altar
alter
alteration
alternate
alternative
although
altitude
altogether
altruism
altruistic
aluminium
aluminium,
aluminum
alumna
alumnus
always
am
amalgam
amalgamate
amass
amateur
amateurish
amaze
amazed
amazing
ambassador
amber
ambi-
ambidextrous
ambience
ambiguity
ambiguous
ambition
ambitious
ambivalence
ambivalent
amble
ambrosial
ambulance
ambulatory
ambush
ameliorate
amenable
amend
amendment
amenity
amethyst
amiable
amicable
amid
amidst
amino
amiss
amity
ammeter
ammonia
ammunition
amnesia
amnesty
among
amongst
amoral
amorphous
amortize
amount
amount to
ampere
amphibian
amphibious
ample
amplifier
amplify
amplitude
amputate
amulet
amuse
amusement
an
anachronistic
anaemia,
anaerobic
anaesthesia,
anaesthetic,
anaesthetize,
anagram
anal
analgesia
analgesic
analogous
analogue
analogy
analyse,
analysis
analyst
analytic(al)
analyze
anarchic
anarchist
anarchy
anathema
anatomical
anatomy
ancestor
ancestral
ancestry
anchor
anchorage
anchorman
anchorwoman
ancient
ancillary
and
anecdote
anemia
anemic
anesthetic
anew
angel
anger
angle
angle1
angle2
angrily
angry
anguish
angular
anhydrous
animadvert
animal
animate
animated
animation
animosity
animus
ankle
annals
annex
annexation
annihilate
anniversary
annotate
announce
announcement
announcer
annoy
annoyance
annoyed
annual
annually
annuity
annul
anode
anodyne
anomalous
anomaly
anonymity
anonymous
anorexia
another
answer
answer back
answer for
ant
antagonism
antagonist
antagonize
antarctic
ante-
antecedence
antecedent
antedate
antediluvian
antelope
antenna
anterior
anthem
anthology
anthropoid
anthropologist
anthropology
anti-
antibiotic
antibody
antic
anticipate
anticipation
anticipatory
anticlimax
antidote
antihistamine
antilogarithm
antipathy
antiquated
antique
antiquity
antiseptic
antithesis
antler
antonym
anus
anvil
anxiety
anxious
anxiously
any
anybody
anyhow
anymore
anyone
anything
anytime
anyway
anywhere
aorta
apace
apart
apartheid
apartment
apathetic
apathy
ape
aperture
apex
aphorism
apiary
apiece
aplomb
apocalyptic
apocrypha
apocryphal
apogee
apologetic
apologize
apology
apoplectic
apoplexy
apostasy
apostate
apostrophe
apothecary
apothegm
apotheosis
appall
appalling
apparatus
apparel
apparent
apparently
apparition
appeal
appealing
appear
appearance
appease
appellation
append
appendage
appendicitis
appendix
appetite
appetizer
appetizing
applaud
applause
apple
appliance
applicable
applicant
application
apply
appoint
appointee
appointment
apposite
appraisal
appraise
appreciable
appreciate
appreciation
appreciative
apprehend
apprehension
apprehensive
apprentice
apprise
approach
approbation
appropriate
approval
approve
approximate
apricot
apron
apropos
apt
aptitude
aquarium
aquatic
aqueduct
aquifer
aquiline
arabesque
arable
arachnid
arbiter
arbitrary
arbitrate
arbitration
arbitrator
arboreal
arboretum
arc
arcade
arcane
arch
arch-
archaeologist
archaeology
archaic
archbishop
archer
archetype
archipelago
architect
architecture
archive
archway
arctic
ardent
ardor
ardour,
arduous
are
area
aren't
arena
argot
argue
argue out
argument
argumentative
aria
arid
arise
aristocracy
aristocrat
aristocratic
arithmetic
ark
arm
arm1
arm2
armada
armament
armchair
armed
armed forces
armistice
armor
armory
armour,
armoury
armpit
army
aroma
aromatic
around
arouse
arraign
arrange
arrangement
arrant
array
arrears
arrest
arresting
arrhythmic
arrival
arrive
arrogance
arrogant
arrogate
arrow
arroyo
arsenal
arson
art
artery
artful
arthritis
article
articulate
artifact
artifact,
artifacts
artifice
artificial
artillery
artisan
artist
artistic
artistry
artless
as
ascend
ascendancy
ascendant
ascending
ascent
ascertain
ascetic
ascribe
aseptic
ash
ashamed
ashore
ashtray
aside
asinine
ask
ask after
ask around
askance
askew
asleep
asparagus
aspect
aspen
asperity
asperse
aspersion
asphalt
asphyxia
asphyxiate
aspirant
aspiration
aspire
aspirin
ass
assail
assailant
assassin
assassinate
assault
assay
assemble
assembly
assent
assert
assertion
assertive
assertiveness
assess
assessment
asset
assiduous
assign
assignment
assimilate
assist
assistance
assistant
associate
associated
association
assoil
assorted
assortment
assuage
assume
assumption
assurance
assure
assured
assuredly
asterisk
asteroid
asthma
astigmatic
astonish
astonished
astonishment
astound
astral
astray
astringent
astro-
astrolabe
astrology
astronaut
astronomer
astronomical
astronomy
astrophysics
astute
asunder
asylum
asymmetric
at
atheism
athlete
athletic
athletics
atlas
atmosphere
atmospheric
atom
atomic
atomic/əˈtɒmɪk/adv.1.原子的2.原子能的3.原子武器的
atonal
atone
atrocious
atrocity
atrophy
attach
attache
attachment
attack
attain
attainment
attempt
attend
attendance
attendant
attention
attentive
attenuate
attest
attic
attire
attitude
attorney
attract
attraction
attractive
attribute
attribute1/
attribute2
attrition
attune
auction
auction off
auctioneer
audacious
audible
audience
audio
audio-
audiovisuals
audit
audition
auditor
auditorium
auger
augment
augmentation
augur
augury
august
aunt
aura
aural
aureole
auricular
auspice
auspices
auspicious
austere
austerity
authentic
authenticity
author
authorise
authoritarian
authoritative
authority
authorization
authorize
auto
auto-
autobiographic(al)
autobiography
autocracy
autocrat
autocratic
autograph
automate
automatic
automation
automobile
autonomous
autonomy
autopsy
autumn
auxiliary
avail
availability
available
avalanche
avant-garde
avarice
avaricious
avenge
avenue
aver
average
average out
averse
aversion
avert
aviary
aviation
aviator
avid
avocation
avoid
avow
avowal
avuncular
await
awake
awaken
award
aware
awareness
away
awe
awe-inspiring
awesome
awful
awfully
awkward
awkwardly
awl
awning
awry
axe
axiom
axis
axle
azure
babble
baby
baby-sit
bacchanal
bachelor
back
back away
back down
back off
back out
back up
backbiting
backbone
backbreaking
backdate
backdrop
backfire
background
backhand
backhanded
backing
backlighting
backset
backside
backslide
backup
backward
backwards
backwater
backyard
bacon
bacteria
bacterium
bad
bad(worse,
bad-tempered
badge
badger
badger1
badger2
badinage
badly
badminton
baffle
bag
bag up
baggage
baggy
bail
bail1
bail2
bait
bake
baker
bakery
balance
balance out
balcony
bald
bale
baleful
balk
balky
ball
ball-point
ball1
ball2
ballad
ballast
ballerina
ballet
ballistics
balloon
ballot
balm
balmy
balustrade
bamboo
bamboozle
ban
banal
banana
band
band together
bandage
bandit
bandwagon
bandy
bane
bang
banish
banister
banjo
bank
bank1
bank2
banker
banking
bankrupt
bankruptcy
banner
banquet
banter
baptism
baptize
bar
barb
barbarian
barbaric
barbarous
barbecue
barber
barcode
bard
bare
barefaced
barely
bargain
bargain for
barge
baritone
bark
bark1
bark2
barley
barn
barometer
barometre,
baron
baroque
barracks
barrage
barrel
barren
barricade
barrier
barrister
barrow
barter
base
base1
base2
base3
baseball
based
basement
bash
bashful
basic
basically
basics
basin
basis
bask
basket
basketball
bass
bassoon
bastard
baste
bastion
bat
bat1
bat2
batch
bath
bathe
bather
bathetic
bathroom
baton
battalion
batter
battery
battle
battlefield
bauble
bauxite
bawdy
bawl
bay
bay1
bay2
bayonet
bazaar
be
be-
beach
beacon
bead
beak
beaker
beam
bean
bean-sprout
bear
bear down
bear out
bear up
bear with
bear1
bear2
beard
bearing
beast
beastly
beat
beat down
beat out
beat up
beat up on
beaten
beatific
beating
beautiful
beautify
beauty
beaver
because
beckon
become
becoming
bed
bed down
bedding
bedeck
bedizen
bedlam
bedraggled
bedroom
bedtime
bee
beef
beeper
beer
beet
beetle
befall
befit
before
beforehand
befoul
befuddle
befuddlement
beg
beget
beggar
begin
beginner
beginning
begrudge
beguile
behalf
behave
behavior
behaviour
behaviour,
behead
behind
behold
beholden
beholder
behoove
beige
being
belabor
belated
belch
beleaguer
belie
belief
believe
believer
belittle
bell
bellicose
belligerence
belligerent
bellow
bellwether
belly
belong
belongings
beloved
below
belt
belt out
belt up
bemoan
bemused
bench
benchmark
bend
beneath
benediction
benefactor
beneficial
beneficiary
benefit
benevolence
benevolent
benign
benison
bent
bequeath
bequest
berate
bereave
bereaved
bereft
berry
berserk
berth
beset
beside
besides
besiege
besmirch
besot
best
bestial
bestow
bestseller
bet
betoken
betray
betroth
better
between
beverage
beware
bewilder
bewildering
bewitch
bewitching
beyond
bi-
bias
bibliography
bibliophile
bibulous
bicker
bicycle
bid
bid up
bidding
bide
biennial
bifocals
bifurcate
big
bigot
bigoted
bike
bikini
bilateral
bile
bilingual
bilious
bilk
bill
billiards
billion
billow
billowy
bin
binary
bind
binder
binding
binge
bingo/ˈbɪŋɡəʊ/n.宾戈(以金钱或财物作输赢的赌博)
binoculars
bio-
biochemistry
biographic(al)
biography
biological
biologist
biology
biosphere
biotechnology
bipartisan
biped
birch
bird
birth
birthday
birthplace
birthrate
biscuit
bisect
bishop
bison
bit
bit1
bit2
bitch
bite
bite back
bitter
bitterly
bizarre
black
black out
blackball
blackboard
blacken
blackmail
blackout
blacksmith
bladder
blade
blame
blanch
bland
blandishment
blank
blanket
blare
blare/bleə/v.发嘟嘟声,发出响而刺耳的声音
blasphemy
blast
blast away
blast off
blast out
blasé
blatant
blather
blaze
blazon
bleach
bleachers
bleak
bleary
bleat
bleed
bleep
blemish
blend
bless
blessed
blessing
blight
blighted
blind
blink
blip
bliss
blissful
blister
blithe
blitz
blizzard
bloated
blob
block
block in
block off
block out
block up
blockade
blockage
blond
blonde
blood
bloody
bloom
blooming
blossom
blot
blotch
blotter
blouse
blow
blow out
blow over
blow up
blow1
blow2
blowhard
bludgeon
blue
blueprint
blues
bluff
bluff1
bluff2
blunder
blunt
blur
blurb
blurt
blush
bluster
blustering
board
board out
board up
boardroom
boast
boastful
boat
bobsleigh
bode
bodily
boding
body
bodyguard
bog
boggle
bogus
bohemian
boil
boil away
boil down
boil down to
boil over
boil up
boiler
boisterous
bold
boldness
bolster
bolt
bomb
bomb out
bombard
bombardment
bombast
bombastic
bomber
bombshell
bona
bonanza
bond
bondage
bone
bone up on
bonfire
bonhomie
bonnet
bonny
bonus
bony
boo
booby
book
book in
bookcase
bookish
bookkeeping
booklet
bookmark
bookseller
bookshelf
bookshop
bookstall
bookstore
boom
boom1
boom2
boon
boor
boost
boot
boot out
booth
bootleg
bootless
booze
border
border on
borderline/ˈbɔːdəlaɪn/adj.两可的,不确定n.界线,国界
bore
bore1
bore2
bored
boredom
boring
boring1
boring2
born
borough
borrow
bosom
boss
bossy
botanical
botanist
botany
botch
both
bother
bottle
bottle out
bottle up
bottleneck
bottom
bottom out
bough
boulder
boulevard
bounce
bouncing
bound
bound1
bound2
bound3
boundary
boundless
bounteous
bountiful
bounty
bouquet
bourgeois
bourgeoisie
bout
boutique
bovine
bow
bow1
bow2
bow3
bowdlerize
bowels
bower
bowl
bowl out
bowl over
bowl1
bowl2
bowler1
bowler2
bowling
box
box in
box1
box2
boxer
boxing
boy
boycott
boyfriend
bra
brace
bracelet
bracing
bracket
brackish
brag
braggadocio
braggart
braid
braille
brain
brainless
brainstorming
brainwash
brake
branch
branch off
branch out
brand
brandish
brandy
brash
brass
brassy
brat
brattish
bravado
brave
bravery
bravura
brawl
brawny
bray
brazen
breach
bread
breadth
break
break away
break down
break in
break into
break off
break out
break through
break up
breakdown
breakfast
breakthrough
breast
breath
breathe
breathe in
breathe out
breathless
breathtaking
breed
breeze
breezeway
brevity
brew
brewery
bribe
bribery
brick
bricklayer
bridal
bride
bridegroom
bridge
bridle
brief
briefcase
briefing
briefly
brigade
bright
brighten
brilliance
brilliant
brim
brindled
bring
bring about
bring along
bring around
bring back
bring down
bring forward
bring in
bring off
bring on
bring out
bring to
bring up
brink
brisk
bristle
brittle
broach
broad
broadcast
broadcasting
broaden
brocade
broccoli
brochure
broil
broke
broken
broker
brokerage
bromide
bronchitis
bronze
brooch
brood
brook
broom
brothel
brother
brother-in-law
brotherhood
brotherly
brow
browbeat
brown
browse
browser
bruise
bruit
brunch
brunette
brunt
brush
brush aside
brush off
brush up
brusque
brutal
brute
brutish
bubble
buck
bucket
buckle
bucolic
bud
buddy
budge
budget
budget for
buff
buffalo
buffer
buffet
buffet1
buffet2
buffoon
bug
bugaboo
buggy
bugle
build
build up
build up to
builder
building
bulb
bulge
bulk
bulky
bull
bulldoze
bulldozer
bullet
bulletin
bullheaded
bullion
bullish
bully
bullyrag
bum
bumble
bump
bumper
bumpkinly
bumptious
bun
bunch
bunch up
bundle
bungalow
bungle
bunk
bunker
buoy
buoyancy
buoyant
burden
burdensome
bureau
bureaucracy
bureaucrat/ˈbjʊərəkræt/n.1.官员,官僚2.官僚作风的人
burgeon
burglar
burglary
burial
burlesque
burn
burn down
burn off
burn out
burn up
burning
burnish
burrow
burst
burst into
burst out
bury
bus
bush
bushel
bushy
business
businessman
bust
bust1
bust2
bustle
busy
but
butcher
butler
butt
butt1
butt2
butter
butter up
butterfly
buttock
button
buttress
buxom
buy
buy into
buy off
buy out
buy up
buyer
buzz
by
by-product
bye
byline
bypass
byproduct
bystander
byte
byword
cab
cabal
cabaret
cabbage
cabin
cabinet
cable
cache
cachet
cackle
cacophonous
cacophony
cactus
cadaver
cadence
cadet
cadge
cadre
cafeteria
café
cage
cajole
cake
calamity
calcium
calculate
calculated
calculating
calculation
calculator
calculus
caldron
calendar
calf1
calf2
caliber
calibrate
calibre
calibre,
calipers
call
call back
call for
call in
call off
call on
call out
call up
calligraphy
callous
callow
callus
calm
calm down
calorie
calumniate
calumny
camel
cameo
camera
camouflage
camp
camp out
campaign
campus
can
can1
can2
canal
canard
canary
cancel
cancel out
cancer
candid
candidacy
candidate
candle
candor
candy
cane
canine
canker
cannery
cannibal
cannibalism
cannon
canny
canoe
canon
canonical
canopy
canorous
cant
cantankerous
cantata
canteen
canter
canto
canvas
canvass
canyon
cap
capability
capable
capacious
capacity
cape
cape1
cape2
caper
capillary
capital
capitalism
capitalist
capitalize
capitation
capitulate
caprice
capricious
capsize
capsule
captain
caption
captious
captivate
captive
captivity
capture
car
carafe
carapace
carat
caravan
carbohydrate
carbon
carcass
carcinogen
card
cardboard
cardiac
cardigan
cardinal
cardinal1
cardinal2
cardiologist
care
careen
career
carefree
careful
carefully
careless
caress
caretaker
careworn
cargo
caribou
caricature
carillon
caring
carnage
carnal
carnation
carnival
carnivore
carnivorous
carol
carouse
carp
carpenter
carpentry
carpet
carriage
carrier
carrion
carrot
carry
carry off
carry on
carry out
carry over
carry through
cart
cartilage
cartographer
carton
cartoon
cartridge
carve
cascade
cascara
case
case1
case2
case3
cash
cash in
cashier
cashmere
casino
cask
cassette
cast
cast around for
cast aside
cast down
cast off
cast out
caste
castigate
castigation
castle
casual
casualty
cat
cataclysm
catalog
catalogue,
catalyst
catapult
cataract
catastrophe
catcall
catch
catch on
catch out
catch up
catch up with
catching
catchword
catchy
categorical
categorize
category
cater
caterpillar
catharsis
cathedral
cathode
catholic
cattle
catwalk
caucus
cauliflower
caulk
causal
cause
caustic
cauterize
caution
cautionary
cautious
cavalcade
cavalier
cavalry
cave
cave in
caveat
cavern
caviar
cavil
cavity
cavort
cease
ceasefire
ceaseless
cedar
cede
ceiling
celebrate
celebrated
celebration
celebrity
celerity
celery
celestial
celibate
cell
cellar
cello
cellular
celluloid
cement
cemetery
censor
censorious
censorship
censure
census
cent
centaur
centenary
centennial
centi-
centigrade
centimetre,
central
centralise,
centralization
centre
centre,
centrifugal
centripetal
centrist
centurion
century
cephalic
ceramic
ceramics
cereal
cerebral
ceremonial
ceremonious
ceremony
certain
certainly
certainty
certificate
certification
certify
certitude
cessation
cession
cesspit
chafe
chaff
chaffing
chagrin
chain
chair
chairman
chalet
chalice
chalk
challenge
challenging
chamber
chameleon
champ
champagne
champion
championship
chance
chancellor
chandelier
change
change down
change over
change up
changeable
channel
chant
chaos
chaotic
chap
chapel
chaperone
chaplain
chapter
char
character
characterise,
characteristic
characterization
characterize
charade
charcoal
charge
chargeable
chariot
charisma
charismatic
charitable
charity
charlatan
charm
charming
chart
charter
chartered
charwoman
chary
chase
chase away
chase down
chase up
chasm
chaste
chasten
chastise
chastity
chat
chat up
chatter
chatterbox
chauffeur
chauvinism
chauvinistic
cheap
cheat
check
check in
check off
check out
check up
checked
checkered
checklist
checkmate
checkout
checkpoint
cheek
cheeky
cheer
cheer on
cheer up
cheerful
cheese
chef
chemical
chemist
chemistry
cheque,
cherish
cherry
cherubic
chess
chest
chestnut
chew
chic
chicanery
chick
chicken
chicken out
chide
chief
chiefly
chieftain
child
childhood
childish
chill
chilled
chilli
chilly
chime
chimera
chimney
chimpanzee
chin
china
chip
chip away at
chip in
chipmunk
chipper
chirp
chisel
chivalrous
chivalry
chlorine
chlorophyll
chocolate
choice
choir
choke
cholera
choleric
cholesterol
choose
chop
chop down
chop off
chop up
choppy
chopsticks
choral
chord
chore
choreographer
choreography
chortle
chorus
christen
chromatic
chrome
chromosome
chronic
chronical
chronicle
chronological
chronology
chrysanthemum
chubby
chuck
chuckle
chum
chunk
church
churchyard
churl
churlish
churn
cider
cigar
cigarette
ciliate
cinder
cineaste
cinema
cipher
circle
circuit
circuitous
circular
circulate
circulation
circumference
circumlocution
circumlocutory
circumscribe
circumspect
circumstance
circumstantial
circumvent
circus
cistern
citation
cite
citizen
citizenship
city
civic
civil
civil war
civilian
civilisation，civilization
civilise,
civility
clad
claim
claimant
clairvoyance
clairvoyant
clam
clamber
clammy
clamor
clamour,
clamp
clan
clandestine
clang
clannish
clap
clarify
clarion
clarity
clash
clasp
class
classic
classical
classification
classified
classify
classmate
classroom
clatter
clause
claustrophobia
claw
clay
clean
clean out
clean up
clean up after
cleaner
cleanse
clear
clear away
clear off
clear out
clear up
clearance
clearway
cleavage
cleave
cleaver
cleft
clemency
clement
clench
clergy
clergyman
clerk
clever
cliche
cliché
click
client
clientele
cliff
climactic
climate
climax
climax/ˈklaɪmæks/n.1.逐渐增强达到顶点2.顶点,极点，(小说、戏剧等的)高潮v.
climb
climb down
clinch
cling
clinic
clinical
clip
clip1
clip2
clipper
clique
cloak
clock
clock in
clock in at
clock off
clock on
clock out
clock up
clockwise
clog
cloister
clone
close
close in
close off
close up
closed-minded
closely
closet
closure
clot
cloth
clothes
clothing
cloture
cloud
cloud over
cloudburst
cloudy
clout
clown
cloy
cloying
club
club together
clue
clump
clumsy
cluster
clutch
clutter
co-
co-ed
co-operate
coach
coagulant
coagulate
coagulation
coal
coalesce
coalition
coarse
coarsen
coast
coastal
coastline
coat
coax
cob
cobble
cobbler
cobra
cobweb
cocaine
cock
cockroach
cocktail
cocky
cocoa
coconut
cocoon
cod
coda
coddle
code
codify
coefficient
coerce
coercion
coeval
coexist
coffee
coffer
coffin
cog
cogent
cogitate
cognate
cognition
cognitive
cognizance
cognizant
cognomen
cohabit
cohere
coherent
cohesion
cohesive
coil
coin
coinage
coincide
coincidence
coke
cola
colander
cold
cold-blooded
collaborate
collaboration
collaborator
collage
collapse
collar
collate
collateral
colleague
collect
collect up
collected
collection
collective
collectively
collector
college
collegiate
collide
collision
colloquial
colloquium
colloquy
collude
collusion
colon
colon1
colon2
colonel
colonial
colonialist
colonize
colonnade
colony
coloration
colossal
colossus
colour
colour in
colour,
coloured
colourful
colourless
colt
coltish
column
columnist
coma
comatose
comb
combat
combatant
combination
combine
combustible
combustion
come
come about
come across
come along
come around
come at
come back
come back to
come between
come by
come down
come down on
come down to
come down with
come for
come forward
come in
come in for
come into
come off
come on
come on to
come out
come out in
come out with
come over
come through
come to
come under
come up
come up against
come up for
come up to
come up with
come upon
comedian
comedienne
comedy
comely
comestible
comet
comfort
comfortable
comic
coming
comity
comma
command
commandant/ˌkɒmənˈdænt/n.司令官,指挥官,军校校长
commander
commandment
commemorate
commence
commencement
commend
commendation
commensurate
comment
commentary
commentate
commentator
commerce
commercial
commingle
commiserate
commission
commissioner
commit
commitment
committed
committee
commodious
commodity
common
commonplace
commonsense
commonwealth
commotion
communal
commune
communicable
communicate
communication
communicative
communion
communique
communism
communist
community
commute
compact
companion
companionship
company
comparable
comparative
comparatively
compare
compared
comparison
compartment
compass
compassion
compassionate
compassionate/kəmˈpæʃənɪt/adj.有同情心的
compatible
compatriot
compel
compelling
compendium
compensate
compensation
compensatory
compete
competence
competent
competition
competitive
competitor
compile
complacency
complacent
complain
complaint
complaisance
complaisant
complement
complementary
complete
completely
completion
complex
complexion
complexity
compliance
compliant
complicate
complicated
complicity
compliment
complimentary
comply
component
comport
compose
composed
composer
composite
composition
compost
composure
compound
comprehend
comprehensible
comprehension
comprehensive
compress
compressor
comprise
compromise
compulsion
compulsive
compulsory
compunction
compute
computer
comrade
con
concatenate
concave
conceal
concede
conceit
conceited
conceivable
conceive
concentrate
concentration
concentric
concept
conception
conceptual
concern
concerned
concerning
concert
concerted
concerto
concession
conciliate
conciliatory
concise
conclave
conclude
conclusion
conclusive
concoct
concomitant
concord
concrete
concubine
concur
concurrence
concurrent
concussion
condemn
condensation
condense
condescend
condescending
condign
condiment
condition
conditional
conditioner
condole
condolence
condom
condone
condor
conducive
conduct
conductivity
conductor
conduit
cone
confection
confederacy
confederate
confer
conference
confess
confession
confetti
confidant
confide
confidence
confident
confidential
configuration
confine
confinement
confirm
confirmation
confiscate
conflagration
conflate
conflict
conform
conformist
conformity
confound
confront
confrontation
confuse
confusion
congeal
congenial
congenital
congest
congested
congestion
conglomerate
congratulate
congratulation
congregate
congregation
congress
congressional
congressman
congruence
congruent
congruity
congruous
conical
conifer
coniferous
conjecture
conjoin
conjugal
conjunction
conjure
connect
connection
connection,
connivance
connive
connoisseur
connotation
connote
connubial
conquer
conqueror
conquest
conscience
conscientious
conscientiously
conscious
consciously
consciousness
conscript
consecrate
consecutive
consensus
consent
consequence
consequent
consequential
consequently
conservation
conservatism
conservative
conservatory
conserve
consider
considerable
considerate
considerate/kənˈsɪdərɪt/adj.关切的,体贴的,替人设想的
consideration
considering
consign
consignment
consist
consistency
consistent
consistently
console
consolidate
consolidation
consonance
consonant
consort
consortium
conspectus
conspicuous
conspiracy
conspire
constable
constancy
constant
constantly
constellation
consternation
constituency
constituent
constitute
constitution
constitutional
constrain
constrained
constraint
constrict
constricted
constringe
construct
construct/kənˈstrʌkt/v.1.建造2.构(词),造(句)
construction
constructive
construe
consul
consulate
consult
consultant
consultation
consume
consumer
consummate
consumption
contact
contagious
contain
container
containerization
containment
contaminate
contemn
contemplate
contemporary
contempt
contemptible
contemptuous
contend
content
content1
content2
contented
contention
contentious
contest
contestant
context
contiguous
continent
continental
contingency
contingent
contingent1
contingent2
continual
continually
continuation
continue
continuity
continuous
continuum
contort
contour
contraband
contraception
contraceptive
contract
contract out
contraction
contractor
contradict
contradiction
contradictory
contrary
contrast
contravene
contribute
contribution
contributor
contrite
contrition
contrive
contrived
control
controversial
controversy
controvert
contumacious
contumacy
contumely
conundrum
conurbation
convalesce
convalescent
convection
convene
convenience
convenient
convention
conventional
converge
convergent
conversant
conversation
converse
converse1
converse2
converse3
conversion
convert
convertible
convex
convey
convict
conviction
convince
convinced
convincing
convivial
conviviality
convoke
convoluted
convoy
convulse
convulsion
cook
cook up
cooker
cookery
cookie
cooking
cool
cool down
cool off
cooler
coop
cooperate
cooperation
cooperative
coordinate
cop
cope
copier
copious
copper
copy
copy down
copyright
coral
cord
cordial
corduroy
core
cork
corn
cornea
corner
cornerstone
cornet
cornucopia
corny
corollary
corona
coronation
coroner
corporal
corporate
corporation
corporeal
corps
corpse
corpulent
corpus
corpuscle
corral
correct
correction
correlate
correspond
correspondence
correspondent
corridor
corroborate
corrode
corrosion
corrosive
corrugate
corrugated
corrupt
corruption
coruscate
cos
cosmetic
cosmic
cosmopolitan
cosmopolitanism
cosmos
cosset
cost
costly
costume
cosy(cozy)
cosy,
cosy（cozy）
cot
coterie
coterminous
cottage
cotton
cotton on
couch
cougar
cough
cough up
could
council
council(l)or
counsel
counsel(l)or
counseling
counselor
count
count against
count in
count on
count out
count towards
countable
countenance
counter
counter-
counteract
counterattack
counterbalance
counterdrug
counterfeit
countermand
counterpart
counterpoise
counterproductive['kautəprə,dʌktiv]
counterproductive[ˈkautəprə,dʌktiv]
countess
countless
countrified
country
countryside
county
coup
couple
coupon
courage
courageous
courier
course
court
courteous
courtesy
courtship
courtyard
cousin
coven
covenant
cover
cover up
coverage
covert
covet
covetous
cow
cow1
cow2
coward
cowardice
cowardly
cowboy
cower
coy
cozen
cozy
crab
crabbed
crack
crack down
crack up
cracker
crackle
crackpot
cradle
craft
craftsman
crafty
crag
cram
cramp
cramped
crane
cranky
crap
crash
crash out
crass
crate
crater
cravat
crave
craven
craving
crawl
crayon
craze
crazy
creak
cream
cream off
creamy
crease
create
creation
creative
creativity
creator
creature
credence
credential
credentials
credibility
credible
credit
creditor
credo
credulous
creed
creek
creep
cremate
crematorium
creole
crepuscular
crescendo
crescent
crest
crestfallen
crevice
crew
crib
cricket
cricket1
cricket2
crime
criminal
crimp
crimson
cringe
cringing
crinkle
cripple
crippling
crisis
crisp
crisscross
criteria
criterion
critic
critical
criticism
criticize
criticize,
critique
croak
crochet
crockery
crocodile
cronyism
crook
crooked
croon
crop
crop up
cross
cross off
cross out
cross-
cross-examine
crossbow
crosscheck
crossing
crossroads
crossword
crotch
crotchety
crouch
crow
crowd
crowd in
crowd out
crown
crucial
crucify
crude
crudity
cruel
cruelty
cruise
cruiser
crumb
crumble
crumple
crunch
crusade
crush
crust
crustacean
crutch
crux
cry
cry off
cry out
cry out for
cryogenic
crypt
cryptic
crystal
cub
cube
cubic
cubicle
cuckoo
cucumber
cuddle
cudgel
cue
cuff
cuisine
culinary
cull
culminate
culmination
culpable
culprit
cult
cultivate
cultivated
cultivation
cultural
culture
cumber
cumbersome
cumulative
cumulus
cuneiform
cunning
cup
cupboard
cupidity
curable
curator
curb
curd
curdle
cure
curfew
curiosity
curious
curl
curmudgeon
currency
current
currently
curriculum
currish
curry
curse
cursed
cursive
cursor
cursory
curt
curtail
curtain
curvaceous
curve
cushion
custard
custodian
custody
custom
customary
customer
cut
cut across
cut back
cut down
cut in
cut off
cut out
cut up
cute
cuticle
cutlery
cutting
cyberspace
cycle
cyclic(al)
cyclical
cyclist
cyclone
cygnet
cylinder
cynic
cynical
cynicism
cynosure
cypress
cytology
dab
dab1
dab2
dabble
dabbler
dad
daddy
daffodil
daft
dagger
daguerreotype
daily
dainty
dairy
dais
daisy
dalliance
dally
dam
damage
damn
damned
damp
damp1
damp2
damped
dampen
damper
damsel
dance
dancer
dancing
dandelion
dandy
dandy1
dandy2
danger
dangerous
dangerous/ˈdeɪndʒərəs/adj.危险的,不安全的
dangle
dank
dapper
dappled
dare
daredevil
daredevil/ˈdeədevəl/n.鲁莽大胆的人,冒失鬼
daring
dark
darken
darkness
darling
darn
dart
dash
dashing
dastard
data
database
date
date back
date from
date1
date2
dated
daub
daubster
daughter
daughter-in-law
daunt
dauntless
dawdle
dawn
day
daybreak
daydream
daylight
daytime
daze
dazzle
dazzling
de
de-
deacon
deactivate
dead
deaden
deadline
deadlock
deadly
deadpan
deadweight
deaf
deafen
deal
deal out
deal with
deal1
deal2
dealer
dealing
dean
dear
dearth
death
deathly
debacle
debar
debark
debase
debatable
debate
debilitate
debility
debit
debonair
debouch
debrief
debris
debt
debtor
debug
debunk
debut
deca-
decade
decadence
decadent
decamp
decant
decay
decease
deceased
deceit
deceitful
deceive
decelerate
decency
decent
decentralize
deception
deceptive
deci-
decibel
decide
decide on
decidedly
deciduous
decimal
decimate
decipher
decision
decisive
deck
deck out
deck1
deck2
deckhand
declaim
declamation
declaration
declare
declare for
declassify
declination
decline
declivity
decode
decompose
decomposition
decor
decorate
decoration
decorative
decorous
decorum
decoy
decrease
decree
decrepit
decry
dedicate
dedication
deduce
deduct
deductible
deduction
deductive
deed
deem
deep
deepen
deeply
deer
deface
defalcate
defame
default
defeat
defeatist
defect
defect1
defect2
defection
defective
defence
defence,
defend
defendant
defender
defense
defensible
defensive
defer
deference
deferential
defiance
defiant
defiant/dɪˈfaɪənt/adj.违抗的,藐视的,蔑视的
deficiency
deficient
deficit
defile
defile1
defile2
define
defined
definite
definitely
definition
definitive
deflate
deflated
deflect
defoliant
defoliate
defoliator
deforest
deforestation
deform
defraud
defray
defrost
deft
defunct
defuse
defy
degenerate
degradation
degrade
degree
dehydrate
deify
deign
deity
dejected
delay
delectable
delectation
delegate
delegation
delete
deleterious
deli
deliberate
deliberate1
deliberate2
deliberately
deliberation
delicacy
delicate
delicatessen
delicious
delight
delighted
delightful
delimit
delineate
delinquency
delinquent
delirious
delirium
deliver
deliverance
deliverer
delivery
delta
delude
deluge
delusion
deluxe
delve
demagogue
demagogue,
demagogy
demand
demanding
demarcate
demean
demeanour
demeanour,
demented
demerit
demise
demo
demobilize
democracy
democrat
democratic
demography
demolish
demolition
demon
demonic
demonstrable
demonstrate
demonstration
demonstrative
demonstrator
demoralize
demoralize,
demote
demotic
demur
demure
demystify
den
denial
denigrate
denim
denizen
denominate
denomination
denominator
denote
denouement
denounce
dense
densely
density
dent
dental
dentist
dentistry
denture
denude
denunciate
denunciation
deny
deodorant
depart
department
departure
depend
dependant,
dependence
dependent
depict
deplete
deplore
deploy
depopulate
deport
deportation
deportment
depose
deposit
deposition
depository
depot
depraved
depravity
deprecate
depreciate
depreciation
depredation
depress
depressant
depressed
depressing
depression
deprivation
deprive
depth
deputation
depute
deputize
deputy
deracinate
derail
derange
deranged
derangement
deregulate
derelict
dereliction
deride
derision
derivation
derivative
derive
dermatologist
derogate
derogatory
derrick
desalinize
descend
descendant
descent
describe
description
descriptive
descry
desecrate
desegregate
desert
desert1
desert2
desert3
deserted
deserter
desertion
deserve
desiccate
desideratum
design
designate
designation
designer
designing
desirable
desire
desirous
desist
desk
desktop
desolate
desolation
despair
desperado
desperate
desperately/ˈdespərɪtlɪ/adv.拼命地,不顾一切地,绝望地
desperation
despicable
despise
despite
despoil
despondent
despot
despotic
despotism
dessert
destination
destine
destined
destiny
destitute
destitution
destroy
destroyer
destructible
destruction
destructive
desuetude
desultory
detach
detachable
detached
detachment
detail
detailed
detain
detect
detection
detective
detector
detention
deter
detergent
deteriorate
deterioration
determinant
determination
determine
determined
determiner
deterrent
detest
detestable
detonate
detonation
detour
detract
detraction
detriment
detrimental
detritus
devastate
develop
development
deviant
deviate
deviation
device
devil
devilish
devious
devise
devoid
devolve
devote
devoted
devotee
devotion
devotional
devour
devout
dew
dewdrop
dexterity
dexterous
diabetes
diabolic
diabolical
diagnose
diagnosis
diagnostic
diagonal
diagram
dial
dialect
dialectic
dialogue
dialogue,
diameter
diametrically
diamond
diaphanous
diarrhoea,diarrhea
diary
diatribe
dice
dichotomy
dicker
dictate
dictation
dictator
dictatorial
dictatorship
diction
dictionary
dictum
didactic
diddle
didn't
die
die away
die back
die down
die out
diehard
diesel
diet
dietary
dietetics
dietician,
differ
difference
different
differential
differentiate
difficult
difficulty
diffidence
diffident
diffuse
dig
dig around
dig in
dig out
dig over
dig up
digest
digestible
digestion
digestive
digit
digital
dignified
dignify
dignitary
dignity
digress
digression
dike
dike,
dilapidate
dilapidated
dilapidation
dilate
dilatory
dilemma
dilettante
diligence
diligent
dillydally
dilute
dim
dime
dimension
dimension/daɪˈmenʃən,
dimensional
diminish
diminuendo
diminution
diminutive
dimple
din
din1
din2
dine
diner
dinghy
dingy
dining
dinner
dinosaur
dinosaur/ˈdaɪnəsɔː/n.恐龙,(老式而不好用的)庞然大物
diocesan
diocese
diode
dioxide
dip
diphthong
diploma
diplomacy
diplomat
diplomatic
dipper
dipsomania
dire
direct
direct1
direct2
direction
directive
directly
director
directory
dirge
dirt
dirty
dis-
disability
disable
disabuse
disadvantage
disadvantaged
disadvantageous
disaffect
disagree
disagreeable
disagreement
disappear
disappoint
disappointed
disappointing
disappointment
disapproval
disapprove
disarm
disarmament
disarming
disarrange
disarray
disassociate
disaster
disastrous
disavow
disband
disbar
disbelief
disbelieve
disburse
disc,
discard
discern
discernible
discerning
discharge
disciple
disciplinary
discipline
disclaim
disclaimer
disclose
disclosure
disco
discography
discombobulate
discombobulated[,diskʌm'bɔbjuleitid]
discombobulated[ˌdiskʌmˈbɔbjuleitid]
discomfit
discomfited
discomfiture
discompose
disconcert
discontent
discord
discount
discourage
discourse
discover
discovery
discredit
discreet
discrepancy
discrete
discretion
discretionary
discriminate
discrimination
discriminatory
discursive
discus
discuss
discussion
disdain
disease
disembark
disembodied
disembody
disenchant
disengage
disentangle
disfavour,
disfigure
disfranchise
disgorge
disgrace
disgraceful
disgruntle
disguise
disgust
disgusting
dish
dish out
dish up
dishearten
dishevel
disheveled
dishonest
dishonour,
dishonourable,
dishwasher
disillusion
disillusioned
disinfect
disinfectant
disintegrate
disintegration
disinter
disinterested
disjointed
disjunction
disjunctive
dislike
dislocate
dislodge
disloyal
dismal
dismantle
dismay
dismiss
dismissal
disobedience
disobey
disorder
disparage
disparate
disparity
dispassionate
dispatch
dispatch,
dispel
dispensable
dispensary
dispensation
dispense
disperse
dispirited
displace
displacement
display
displease
displeasure
disport
disposable
disposal
dispose
disposed
disposed/dɪˈspəʊzd/adj.1.愿意的,乐意的2.有…倾向的
disposition
disproof
disprove
dispute
disqualify
disquisition
disregard
disreputable
disrepute
disrespect
disrespectful
disrupt
disruptive
dissatisfaction
dissatisfy
dissect
dissection
dissemble
disseminate
dissension
dissent
dissertation
disservice
dissident
dissimilar
dissimulate
dissipate
dissipated
dissociate
dissociation
dissolute
dissolution
dissolve
dissonance
dissonant
dissuade
distain
distal
distance
distant
distaste
distend
distension
distention
distil(l)
distill
distillation
distinct
distinction
distinctive
distinguish
distinguishable
distinguished
distort
distract
distracted
distraction
distrait
distraught
distress
distressed
distribute
distribution
district
distrust
disturb
disturbance
disunite
disuse
ditch
dither
ditto
ditty
diurnal
diva
divagate
dive
diver
diverge
divergent
divers
diverse
diversification
diversify
diversion
diversity
divert
divest
divestiture
divide
divide off
divide up
dividend
divine
divinity
divisible
division
divisive
divorce
divulge
dizzy
do
do away with
do down
do for
do in
do out
do out of
do over
do up
do without
do-it-yourself
docile
dock
dockyard
doctor
doctorate
doctrinaire
doctrine
document
documentary
documentation
dodder
dodge
doesn't
doff
dog
dog-eared
dog-tired
dogged
doggerel
doggo
dogma
dogmatic
dogmatism
doldrums
dole1
dole2
doleful
doll
dollar
dollop
dolorous
dolphin
dolt
domain
dome
domestic
domesticate
domesticity
domicile
dominant
dominate
domination
domineer
domineering
dominion
domino
don
donate
donation
donator
done
donkey
donor
donut
doodle
doom
doomed
doomsday
door
doorstep
doorway
dope
dormancy
dormant
dormitory
dormitory/ˈdɔːmɪtərɪ/n.集体寝室,(尤指大学)学生宿舍
dorsal
dosage
dose
dossier
dot
dotage
dote
doting
double
double back
double up
double-cross
doubt
doubtful
doubtless
dough
dour
douse
dove
dowager
dowdy
down
down-and-out
down-to-earth
down1
down2
downcast
downfall
downgrade
downhearted
downhill
downplay
downpour
downright
downstairs
downstream
downtime
downtown
downward
dowry
dowse
doyen
doze
dozen
drab
draconian
draft
draftsmanship
drag
drag down
drag in
drag into
drag on
drag out
drag up
draggy
dragon
dragonfly
drain
drainage
drama
dramatic
dramatist
dramatize
drape
drapery
drastic
draught
draughtsman,
draughty,
draw
draw in
draw off
draw on
draw out
draw up
draw1
draw2
drawback
drawbridge
drawer
drawing
drawl
drawn
dread
dreadful
dream
dream up
dreary
dredge
dregs
drench
drenched
dress
dress down
dress up
dressed
dresser1
dresser2
dressing
dressing-gown
dressy
dribble
drift
drift off
drill
drily
drink
drink in
drink to
drink up
drip
dripping
drive
drive away
drive off
drive out
drive-in
drivel
driver
drizzle
drizzly
droll
drollery
drone
drool
droop
drop
drop away
drop by
drop in
drop off
drop out
droplet
dross
drought
drove
drown
drowse
drowsy
drub
drudgery
drug
druggist
drugstore
drum
drum into
drum out
drum up
drummer
drumstick
drunk
drunkard
drunken
dry
dry off
dry out
dry up
dry-clean
dry-cleaner
dryer
dual
dub
dubious
duchess
duchy
duck1
duck2
duckling
duct
ductile
due
duel
duet
duff
duke
dulcet
dull
dullard
duly
dumb
dumbfound
dumbfound,
dummy
dump
dumpling
dumpy
dunce
dune
dung
dungarees
dungeon
duo
dupe
duplicate1
duplicate2
duplicitous
duplicity
durable
duration
duress
during
dusk
dusky
dust
dust off
dustbin
dustcart
duster
dustman
dustpan
dusty
dutiful
duty
duty-free
dwarf
dwell
dweller
dwelling
dwindle
dye
dynamic
dynamics
dynamism
dynamite
dynamo
dynamo/ˈdaɪnəməʊ/n.发电机,充满生气的人
dynasty
dysfunctional
dyslexia
dyspeptic
e-mail
e.
each
eager
eagerness
eagle
eaglet
ear
ear1
ear2
earache
eardrum
earl
earlier
early
earmark
earn
earnest
earnings
earphone
earplug
earring
earring/
earshot
earsplitting
earth
earth-moving
earthen
earthenware
earthly
earthquake
earthshaking
earthwork
earthy
ease
ease off
ease up
easel
easily
east
eastern
eastward(s)
easy
easygoing
eat
eat away
eat into
eat up
eaves
eavesdrop
ebb
ebony
ebullience
eccentric
eccentricity
ecdysis
echo
eclat
eclectic
eclecticism
eclipse
eclogue
ecological
ecologist
ecology
economic
economical
economics
economise,
economist
economize
economy
ecosystem
ecstasy
ecstatic
ecumenical
eczema
eddy
edge
edge out
edgy
edible
edict
edifice
edify
edit
edit out
edition
editor
editorial
educate
education
educational
educationist
educator
eel
eerie
efface
effect
effective
effectuate
effeminate
effervesce
effete
efficacious
efficacy
efficiency
efficient
effigy
effluent
effluvia
effort
effrontery
effulgent
effuse
effusive
egalitarian
egg
egg on
egg1
egg2
eggplant
ego
egocentric
egoism
egoist
egotism
egotist
egregious
egress
eh
eight
eighteen
eighteenth
eighth
eightieth
eighty
either
ejaculate
eject
elaborate
elaborate1
elaborate2
elaboration
elapse
elastic
elasticity
elated
elation
elbow
elder
elderly
eldest
elect
election
electioneering
elective
elector
electoral
electorate
electric
electrical
electrician
electricity
electrify
electrocute
electrode
electromagnet
electron
electronic
electronics
electroplate
electroscope
electrostatic
elegance
elegant
elegy
element
elemental
elementary
elephant
elephantine
elevate
elevation
elevator
eleven
eleventh
eleventh/ɪˈlevnθ/n.&adj.第十一个(的),十一分之一(的)
elf
elicit
eligible
eliminate
elimination
elite
elixir
ellipse
ellipsis
elliptical
elm
elocution
elongate
elope
eloquence
eloquent
else
elsewhere
elucidate
elude
elusive
elysian
em-
emaciate
emaciated
emaciation
emanate
emancipate
emasculate
embalm
embankment
embargo
embark
embarrass
embarrassing/ɪmˈbærəsɪŋ/adj.使人尴尬的,使人为难的
embarrassment
embassy
embattled
embed
embellish
embezzle
embezzlement
embitter
emblazon
emblem
emblematic
embodiment
embody
embolden
emboss
embrace
embroider
embroidery
embroil
embryo
embryonic
emend
emerald
emerge
emergence
emergency
emergent
emigrant
emigrate
emigration
eminence
eminent
emir
emissary
emission
emit
emollient
emolument
emote
emotion
emotional
emotive
empathy
emperor
emphasis
emphasize
emphatic
empire
empirical
empiricism
employ
employe(e)
employee
employer
employment
empower
empress
empty
empyreal
empyrean
emulate
emulsify
en-
enable
enact
enactment
enamel
enamored
encampment
encapsulate
encase
enchant
encipher
encircle
enclave
enclose
enclosure
encomiast
encomiastic
encomium
encompass
encore
encounter
encourage
encouragement
encroach
encumber
encyclopaedia,
encyclopedia
encyclopedic
end
end up
endanger
endangered
endearing
endeavor
endeavour,
endemic
ending
endless
endorse
endow
endue
endurable
endurance
endure
enduring
endways
enemy
energetic
energize
energy
enervate
enfeeble
enfetter
enflame
enfold
enforce
engage
engaged
engagement
engaging
engender
engine
engineer
engineering
engrave
engraving
engross
engrossed
engrossment
engulf
enhance
enigma
enigmatic
enjoin
enjoy
enjoyable
enjoyment
enlarge
enlargement
enlighten
enlightening
enlightenment
enlist
enliven
enmesh
enmity
ennoble
ennui
enormity
enormous
enough
enquire
enquiry
enrage
enrapture
enrich
enrol
enroll
ensconce
ensemble
enshrine
ensign
enslave
ensnare
ensue
ensure
entail
entangle
enter
enter into
enterprise
enterprising
entertain
entertainer
entertaining
entertainment
enthral
enthrall
enthralling
enthrone
enthusiasm
enthusiast
enthusiastic
entice
entire
entirely
entirety
entitle
entitled
entity
entourage
entrance
entrance1
entrance2
entrancing
entrant
entrap
entreat
entreaty
entree
entrench
entrepot
entrepreneur
entrust
entry
entrée
entwine
enumerate
enunciate
envelop
envelope
enviable
envious
environ
environment
environmental
environmentalism
environmentalist
environs
envisage
envision
envoy
envy
enzyme
eon
epaulet
ephemeral
epic
epicure
epicurean
epideictic
epidemic
epidermis
epigram
epilog(ue)
epilogue
episode
episodic
epistolary
epitaph
epithet
epitome
epitomise,
epitomize
epoch
epoch-making
equable
equal
equality
equally
equanimity
equate
equation
equator
equestrian
equi-
equiangular
equidistant
equilateral
equilibrium
equine
equinox
equip
equipment
equitable
equity
equivalence
equivalent
equivocal
equivocate
equivocation
era
eradicate
erase
eraser
erasure
erect
erection
erode
erosion
erotic
err
errand
errant
erratic
erroneous
error
ersatz
erstwhile
erudite
erupt
eruption
escalate
escalation
escalator
escape
escapee
escapism
eschew
escort
esophagus
esoteric
especial
especially
espionage
espousal
espouse
espy
essay
essayist
essence
essential
essentially
establish
establishment
estancia
estate
